[
  {
    "file": "experiments/treerings.js",
    "name": "Tree Rings | Tree of Life",
    "description": "The lines resemble the rings inside a tree. I did this because my last name means forest, so I thought it was a fun idea. The code is adapted from a tutorial by Ahmad Moussa."
  },

  {
    "file": "experiments/treerings2.js",
    "name": "Tree Rings | Version 1 | Spinning tree",
    "description": "An adapted version of the tree rings. The rings spin in a circle, creating what could be interpreted as a thicker tree ring. Or just a circle, however you see it."
  },
  {
    "file": "experiments/treerings3.js",
    "name": "Tree Rings | Version 2 | Topographic map",
    "description": "The tree rings evolved into somehting that resembles a topographic map. The curves are hills and valleys."
  },
  {
    "file": "experiments/perlinnoise2.js",
    "name": "Perlin Noise | Version 1 | Box It",
    "description": "I liked the idea of using perlin noise to create multiple boxes. It created a visual that is difficult but fun to look at."
  },
  {
    "file": "experiments/perlinnoise3.js",
    "name": "Perlin Noise | Version 2 | Nyan Cat",
    "description": "This artwork is inspired by the popular video called Nyan Cat. Even without the cat-attributes it is still very recognisable. The code is adapted from Garrits tutorial."
  },
  {
    "file": "experiments/flowfields2.js",
    "name": "Flow Field | Version 1 | Purple Rain",
    "description": "An adaptation of Tyler Hobbs flow field, code adapted from Codepen. The recreation is an homage to the song Purple Rain by Prince."
  },
  {
    "file": "experiments/flowfields3.js",
    "name": "Flow Field | Version 2 | Sunshine",
    "description": "An adaptation of Tyler Hobbs flow field, code adapted from Codepen. By having the flow fields move toward the center, it creates somehting that resembles the sun."
  },
  {
    "file": "experiments/sound.js",
    "name": "Flow Field  | Version 3 | Musical veins",
    "description": "Flow fields that look like veins and are manipulated by the sound of music. Click once on the screen, then play with the keys:)"
  }
]
